# 无视中断

# 代码清单13-0-1：广义线性模型和glm()函数
# 许多被广泛应用、流行的数据分析方法其实都归属于广义线性模型框架。

# 现假设我们想要对因变量Y和p个自变量X1...Xp间的关系进行建模。
# 在标准线性模型中，我们可以假设Y呈正太分布，关系的形式为：
μY = β0 + Σp j=1 βjXj
# 该等式表明因变量的条件均值是自变量的线性组合。
# 参数βj指一单位Xj的变化造成的Y预期的变化，β0指当所有自变量都为0时Y的预期值。
# 对于该等式，我们可通俗地理解为：给定一系列X变量的值，赋予X变量合适的权重，然后将它们加起来，便可预测Y观测值分布的均值。

# 值得注意的是，我们并没有对自变量Xj做任何分布的假设。
# 与Y不同，它们不需要呈正太分布
# 实际上，它们常为分类变量（比如方差分析设计中的自变量）

# 另外，对自变量使用非线性函数也是允许的，比如我们常会使用自变量X^2或X1xX2，只要等式的参数（β0，β1，...βp）为线性即可
# 广义线性模型拟合的形式为：
g(μY) = β0 + Σp j=1 βjXj
# 其中，g(μY)为条件均值的函数（称为【连接函数】）
# 另外，我们可放松Y为正太分布的假设，改为Y服从指数分布族中的一种分布即可。
# 设定好连接函数和概率分布后，便可以通过最大似然估计的多次迭代推导出各参数值。