# 财务自由才是真的自由

# 代码清单10-0-1：假设检验速览
# 为了帮助理解功效分析的分析步骤，我们将首先简要回顾统计假设检验的概念。

# 在统计假设检验中，首先要对总体分布参数设定一个假设（零假设，H0）
# 然后从总体分布中抽样，通过样本计算所得到的统计量来对总体参数进行推断。
# 假定零假设为真，计算获得观测样本的统计量或一个极端值的概率，
# 如果此概率非常小，便可以拒绝原假设，接受它的对立面（称作【备择假设】或者【研究建设】，H1）

# 下面通过一个例子来阐述整个过程。
# 假设我们想评价使用手机对驾驶员反应时间的影响，则零假设为H0：μ1 - μ2 = 0
# 其中，μ1是驾驶员使用手机时的反应时间均值，μ2是驾驶员不使用手机时的反应时间均值（此处，μ1 - μ2即感兴趣的总体参数）
# 假如你拒绝该零假设，备择假设或研究假设就是H1：μ1 - μ2 ≠ 0。
# 这等价于 μ1 ≠ μ2，即两种情况下反应时间的均值不相等。

# 现招募若干受试者，将他们随机分配到任意一种情况中。
# 第1种情况，受试者边打手机，边在一个模拟器种应对一系列驾驶挑战；
# 第2种情况，受试者在一个模拟器种种完成一系列相同的驾驶挑战，但不打手机。
# 然后评估每个受试者的总体反应时间。

# 基于样本数据，可计算如下统计量：
# （Xbar1 - Xbar2）/（S/n^0.5）

# 其中，Xbar1 和 Xbar2 分布表示两种情况下的反应时间均值。
# s是合并样本标准差，n是每种情况中的受试者数目。
# 如果零假设为真，那么可以假定反应时间呈正太分布，该样本服从2n该样自由度的t分布。
# 依据此事实，我们能计算获得当前或更大样本统计量的概率。
# 但如果概率（p）比预先设定的阈值小（如 p < 0.05），那么我们便可以拒绝原假设接受备择假设。
# 预先约定的阈值（0.05）称为检验的显著性水平（significance level）

# 注意，这里是使用取自总体的样本数据来对总体推断。
# 我们的零假设是所有打手机的驾驶员的反应时间均值与所有（而不仅仅是样本中）不打手机的驾驶员的反应时间均值没什么不同。
# 我们的判断有下列4种可能的结果：
# 【】如果零假设是错误的，统计检验也拒绝它，那么我们便做了一个正确的判断。我们可以断言使用手机影响反应时间。
# 【】如果零假设是真实的，我们没有拒绝它，那么我们再次做了一个正确的判断。说明反应时间不受打手机的影响
# 【】如果零假设是真实的，但我们拒绝了它，那我们便犯了I型错误。我们会得到使用手机会影响反应时间的结论，而实际上不会。
# 【】如果零假设是错误的，而我们没有拒绝它，那么我们便犯了II型错误。使用手机影响反应时间，但我们没有判断出来
# 每种结果的解释见下表

#                       假设检验
#     判断   拒绝H0         不能拒绝H0       
# 实际
# H0为真  【I型错误】          正确
# H0为假      正确         【II型错误】



#### 零假设显著性检验中的争论 ####
# 零假设显著性检验（NHST）并不是没有争议的，批评者早就提出了一大堆质疑，特别是有关它在心理学领域中的应用。
# 他们指出对 p 值存在一个广泛的误解，它依赖的统计显著性比实际显著性大，因此事实上零假设永远不可能为真，对于足够大的样本也总是被拒绝，这会造成在NHST实践中许多逻辑上的不一致。


# 在研究过程中，研究者通常关注4个统计量：【样本量】、【显著性水平】、【功效】 和 【效应值】
# 【】样本量指的是实验设计中每种条件/组中观测值的数目
# 【】显著性水平（也称为alpha）由I型错误的概率来定义。也可以把它看作发现效应不发生的概率。
# 【】功效通过1减去II型错误的概率来定义。我们可以把它看作真实效应发生的概率
# 【】效应值指的是在备择或研究假设下效应的量。效应值的表达式依赖于假设检验中使用的统计方法。


# 虽然研究者可以直接控制样本量和显著性水平，但是对于功效和效应值的影响却是间接的。
# 例如，放宽显著性水平时（换句话说，使得拒绝原假设更容易时），检验的功效便会增大。
# 类似地，样本量增加，功效也会增大。


# 通常来说，研究目标时维持一个可接受的显著性水平，尽量使用较少的样本，然后最大化统计检验的功效。
# 也就是说，最大化发现真实效应的概率，并最小化发现错误效应的概率，同时把研究成本控制在合理的范围内。


# 4个统计量（样本量、显著性水平、功效和效应值）紧密相关，给定其中任意3个统计量，便可推算第4个统计量。
# 接下来，本章将利用这一点进行各种各样的功效分析。
# 下一节将学习如何用R中的pwr包实现功效分析。
# 随后，我们还会简要回顾一些专门在生物学和遗传学中使用的功效函数。
