# 否定之否定定律

# 代码清单10-3：其他功效分析包
# 对于研究的规划阶段，R还提供了不少其他有用的包（见下表）。
# 它们有的包含一般性的分析工具，有的则是高度专业化的。
# 最后4个包聚焦于基因研究中的功效分析。
# 识别基因与可观测特征的关联性的研究称为全基因组关联研究（GWAS）
# 例如，它们可能关注为什么一些人会得某种特殊类型的心脏病

####                  专业化的功效分析包
# 包                   用   涂
# asypow               通过渐进似然比计算功效
# longpower            纵向数据中样本量的计算
# PwrGSD               组序列设计的功效分析
# pamm                 混合模型中随机效应的功效分析
# powerSurvEpi         流行病研究是生存分析中功效和样本量的计算
# powerMediation       线性、Logistic、泊松 和 Cox回归的中介效应中功效和样本量的计算
# semPower             结构方程模型（SEM）的功效分析
# powerpkg             患病同胞配对法和 TDT（Transmission Disequilibrium Test, 传送不均衡检验）设计的功效分析
# powerGWASinteraction GWAS交互作用的功效计算
# gap                  一些病例队列研究设计中计算功效和样本量的函数
# ssize.fdr            微阵列实验中样本量的计算

# 最后，MBESS包 和 WebPower 包也包含了可供各种形式功效分析和样本量判定所用的函数。
# 这些函数主要供行为学、教育学 和 社会科学的研究者使用




#### 小结 ####
# 【】功效分析不仅可以帮助我们判断在给定置信度和效应值的前提下所需的样本量，而且能够说明在给定样本量时检测到要求效应值的概率。对于限定误报效应显著性的可能性（I型错误）和正确检测真实效应（功效）的可能性之间的平衡，我们也有了一个直观的了解

# 【】pwr包提供的函数可以对常见的统计方法（包括t检验、卡方检验、比例检验、方差分析 和 回归）进行功效和样本量的计算。本章最后还介绍了一些专业化的功效分析

# 【】【功效分析通常是一个需要多次尝试的迭代过程。】研究者会通过改变样本量、效应值、预期显著性水平和预期功效水平等参数，来观测它们对于其他参数的影响。这些结果对于研究的筹备是非常有意义的。过去研究的信息（特别是效应值）可以帮助我们在未来设计更有用、更高效的研究。

# 【】功效分析的一个重要附加效应是引起方向性的改变，它鼓励不要仅仅关注二值型（效应存在还是不存在）的假设检验，而应该仔细思考效应值的意义。期刊编辑越来越多地要求作者在报告研究结果的时候既包含p值又包含效应值，因为它们不仅能够帮助我们判断研究的实际意义，还能提供用于未来研究的信息。
