# 重复

# 代码清单10-1-0：在新情况中选择合适的效应值
# 在功效分析中，预期效应值是最难决定的参数。
# 它通常需要我们对主题有一定的了解，并有相应的测量经验。
# 例如，过去研究中的数据可以用来计算效应值，这能为后面深层次的研究提供一些参考

# 但是当面对全新的研究情况，没有任何过去的经验可借鉴，我们能做些什么呢？
# 在行为科学领域，Cohen（1988）曾尝试提出一个基准，可为各种统计检验划分“小”、“中”、“大”3种效应值
# 下表列出了这些基准值

####                   Cohen效应值基准
#  统计方法     效应值测量                    建议的效应值基准
#                                 小                 中                大
#  t检验        d                 0.20               0.50              0.80    
#  方差分析     f                 0.10               0.25              0.40
#  线性模型     f2                0.02               0.15              0.35
#  比例检验     h                 0.20               0.50              0.80
#  卡方检验     w                 0.10               0.30              0.50


# 当我们对研究的效应值一无所知，这个表可以提供一些指引。
# 例如，假如我们想在0.05的显著性水平下，对5个组、每组25个受试者的设计进行单因素方差分析，那么拒绝错误零假设（也就是发现真实的效应值）的概率是多大呢？
# 使用pwr.anova.test()函数和上表中f的建议值，得出以下结果：
pwr.anova.test(k = 5, n = 25, sig.level = 0.05, f = c(.10, .25, .40))
#Balanced one-way analysis of variance power calculation 
#
#k = 5
#n = 25
#f = 0.10, 0.25, 0.40
#sig.level = 0.05
#power = 0.1180955, 0.5738000, 0.9569163
#
#NOTE: n is number in each group

# 小效应值的功效水平为0.118，中等效应值的功效水平为0.574，大效应值的功效水平为0.957
# 给定样本的限制，在大效应值时我们才能发现要研究的效应

# 另外，我们一定要牢记Cohen的基准值仅仅是根据许多社科类研究得出的一般性检验，对于特殊的研究领域可能并不适用
# 其他可选择的方法是改变研究参数，记录其对诸如样本量和功效等方面的影响
# 仍以5个分组的单因素方差分析（显著性水平为0.05）为例，计算了为检测一系列效应值所需的样本量