# 无视中断

# 代码清单13-0-0：高级方法

# 本章将第8章的回归方法扩展至非参数方法，适用于非正太分布的数据。
# 这一章将首先讨论广义线性模型，然后重点讲解因变量为分类变量（Logistic回归）或计数型变量（泊松回归）时的案例

# 第8章（回归）和第9章（方差分析）中，我们探究了线性模型，它们可以通过一系列连续型和/或类别型自变量来预测正太分布的因变量。
# 但在许多情况下，假设因变量为正态分布（甚至连续型变量）并不合理，例如下面这几种情况；
# 【】因变量可能是类别型的。二值变量（比如，是/否、通过/未通过、或者/死亡）和多分类变量（比如，差/良好/优秀）都显然不是正太分布
# 【】因变量可能是计数型的（比如，一周交通事故数、每日洒水消耗的数量）。这些变量都是非负的有限值，而且它们的均值和方差都是相关的（正太分布变量间不是如此，而是相互独立的）

# 【广义线性模型（generalized linear model）扩展了线性模型的框架，兼容了明显不服从正太分布的因变量】

# 在本章中，我们将首先简要概述广义线性模型，并介绍如何使用 glm() 函数来进行估计。
# 然后，我们重点关注该框架中两种流行的模型：Logistic回归（因变量为类别型）和泊松回归（因变量为计数型）


# 为了让讨论更有吸引力，我们将把广义线性模型应用到两个用标准线性模型无法轻易解决的问题上
# 【】什么样的个人信息、人口统计信息 和 人际关系信息可以作为变量，用来预测感情危机问题？自此，因变量为二值型（有过一次感情危机/没有过感情危机）
# 【】药物治疗对于8周中的癫痫发病数有何影响？此时，因变量为计数型（癫痫发病次数）
# 我们将利用Logistic回归来阐释第1个问题，用泊松回归阐释第2个问题。在建模过程中，我们还将考虑对每种方法进行扩展。
