# 太勤奋有时候也是一种病

# 代码清单10-0-8：用pwr包做功效分析-卡方检验
# 卡方检验常常用来评价两个分类变量的关系。
# 通常，零假设是变量之间独立，备择假设是不独立
# pwr.chisq.test() 函数可以评估卡方检验的功效、效应值 和 所需的样本量。格式为：
pwr.chisq.test(w =, N =, df =, sig.level =, power =)
# 其中，w是效应值，N是总样本量，df是自由度。此外，效应值w定义如下：
# w=\textit{\sqrt{\textit{\sum\limits^m_{t=1}{\textit{\frac{\textit{(p0i−p1i)^2}}{p0i}}}}}}
# 其中，p0i = H0时第i单元格中的概率
#       p1i = H1时第i单元格中的概率

# 此处从1到m进行求和，求和符号上的m指的是列表中单元格的数目
# 函数ES.w2(p)可以计算双因素列表中备择假设的效应值，P是一个备择假设的双因素概率表

# 举一个简单的例子，假设我们想研究专业与工作的晋升关系。我们预期样本中70%是金融专业，10%是计算机专业，20%是销售专业。
# 而且，我们认为相比30%的计算机专业和50%的销售专业，60%的学金融专业的人更容易晋升。
# 研究假设的晋升概率如下表所示

####          研究假设下预期晋升的专业占比
#   专业               晋升占比                   未晋升者占比
#   金融                0.42                       0.28
#   计算机              0.03                       0.07
#   销售                0.10                       0.10

# 从表中看到，我们预期总人数的42%是晋升的金融专业（0.42=0.70x0.60），总人数的7%是未晋升的进算计专业（0.07=0.10x0.70）
# 我们取0.05的显著性水平和0.90的预期功效水平。
# 双因素连列表的自由度为(r-1)(c-1)，其中r是行数，c是列数。
# 编写如下代码，我们可以计算假设的效应值：
prob <- matrix(c(.42, .28, .03, .07, .10, .10), byrow = TRUE, nrow = 3)
ES.w2(prob)
# [1] 0.1853198

# 使用该信息，我们又可以计算所需的样本量：
pwr.chisq.test(w = .1853, df = 2, sig.level = .05, power = .9)
#Chi squared power calculation 
#
#w = 0.1853
#N = 368.5317
#df = 2
#sig.level = 0.05
#power = 0.9
#
#NOTE: N is the number of observations

# 结果表明，在既定的效应值、功效水平 和 显著性水平下，该研究需要369个受试者才能检验抓呢与工作晋升的关系。