# 在R中，拟合线性模型最基本的函数就是lm()，格式为：myfit <- lm(formula, data)
# lm()：Linear Model 线性回归函数

# 代码清单8-1：简单线性回归
# 基础安装中的数据集women提供了15个年龄在30~39岁间女性的身高和体重信息。
# 我们想通过身高来预测体重，通过获得一个方差，我们可以分辨出那些过重或过轻的个体。

women                  #height：身高（英寸 inch）    weight：体重（磅 pound）
#    height weight
#1      58    115
#2      59    117
#3      60    120
#4      61    123
#5      62    126
#6      63    129
#7      64    132
#8      65    135
#9      66    139
#10     67    142
#11     68    146
#12     69    150
#13     70    154
#14     71    159
#15     72    164

fit <- lm(weight ~ height, data = women)

summary(fit)
#Call:
#  lm(formula = weight ~ height, data = women)

#Residuals:
#  Min      1Q  Median      3Q     Max 
#-1.7333 -1.1333 -0.3833  0.7417  3.1167 

#Coefficients:
#  Estimate Std. Error t value Pr(>|t|)    
#(Intercept) -87.51667    5.93694  -14.74 1.71e-09 ***
#  height        3.45000    0.09114   37.85 1.09e-14 ***
#  ---
#  Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

#Residual standard error: 1.525 on 13 degrees of freedom
#Multiple R-squared:  0.991,	Adjusted R-squared:  0.9903 
#F-statistic:  1433 on 1 and 13 DF,  p-value: 1.091e-14

women$weight
# [1] 115 117 120 123 126 129 132 135 139 142 146 150 154 159 164

fitted(fit)
#1        2        3        4        5        6        7        8        9       10 
#112.5833 116.0333 119.4833 122.9333 126.3833 129.8333 133.2833 136.7333 140.1833 143.6333 
#11       12       13       14       15 
#147.0833 150.5333 153.9833 157.4333 160.8833 

residuals(fit)
#1           2           3           4           5           6           7 
#2.41666667  0.96666667  0.51666667  0.06666667 -0.38333333 -0.83333333 -1.28333333 
#8           9          10          11          12          13          14 
#-1.73333333 -1.18333333 -1.63333333 -1.08333333 -0.53333333  0.01666667  1.56666667 
#15 
#3.11666667

plot(women$height, women$weight,
     xlab = "Height (in inches)",
     ylab = "Weight (in pounds)")

abline(fit) # 把回归拟合直线 weight(hat)=−87.52+3.45×height画在散点图上

# 从输出结果，我们可以得到预测方程：weight = -87.52 + 3.45 x Height
# 因为身高不可能为0，所以没必要给截距项一个物理解释，它仅仅是一个常量调整项。
# 在Pr(>|t|) 栏，可以看到回归系数（3.45）显著不为0（p<0.001），表面身高每增高1英寸，体重将预计增加3.45英镑。
# R平方项Multiple R-squared（0.991）表面模型可以解释体重99.1%的方差来源，它也是实际和预测值之间相关系数的平方（R^2 = r^2yy）
# 残差标准误（1.53 lbs）则可认为是模型用身高预测体重的评价误差。
# F统计量检验所有的自变量预测因变量是否都在某个概率水平之上。由于简单线性回归只有一个自变量，此处F检验等同于身高回归系数的t检验

# 出于展示的需要，我们已经输出了真实值、预测值和残差值。显然，最大的残差值在身高矮和身高高的地方出现，这也可以从图看出。

# 图形表明我们可以用含一个弯曲的曲线来提高预测的精度。比如，模型Y(hat) = β0(hat) + β1(hat)X + β2(hat)X^2 就能更好地拟合数据。
# 多项式回归允许我们用一个自变量预测一个因变量，它们关系的形式即n次多项式。
