# 量变引起质变

# 代码清单10-0-6：用pwr包做功效分析-线性模型
# 对于线性模型（比如多元回归），pwr.f2.test()函数可以完成相应的功效分析，格式为：
pwr.f2.test(u =, v =, f2 =, sig.level =, power =,)
# 其中，u和v分别是分子自由度和分母自由度，f2是效应值。

# \textit{f^2}=\textit{\frac{\textit{R^2}}{1−\textit{R^2}}}
# 其中，R^2 = 多重相关性的总体平方值

# \textit{f^2}=\textit{\frac{\textit{R^2_{AB}}−\textit{R^2_A}}{1−\textit{R^2_{AB}}}}
# 其中，RA^2 = 集合A中变量对总体方差的解释读，RAB^2 = 集合A和B中变量对总体方差的解释率

# 当要评价一组预测变量对结果的影响程度时，适宜用第1个公式来计算f2；当要评价一组预测变量对结果的影响超过第2组变量（协变量）多少时，适宜用第2个公式


# 现假设我们想研究老板的领导风格对员工满意度的影响。
# 领导风格可用4个变量来评估，薪水和福利待遇与3个变量有关。
# 过去的经验表明，薪水和福利待遇能够解释约30%的员工满意度方差。
# 而从现实出发，领导风格至少能解释35%的方差。
# 假定显著性水平为0.05，那么在90%的置信度的情况下，我们需要多少受试者才能得到这样的方差贡献率呢？
# 此处，sig.level = 0.05，power = 0.90, u = 3（总自变量数减去集合B中的自变量数），效应值为f2 = （0.35-0.30）/（1-0.35）≈0.0769
# 我们将这些信息输入到函数中，得出以下结果：
pwr.f2.test(u = 3, f2 = 0.0769, sig.level = 0.05, power = 0.90)
#Multiple regression power calculation 
#
#u = 3
#v = 184.2426
#f2 = 0.0769
#sig.level = 0.05
#power = 0.9

# 在多元回归中，父母的自由度等于 N-k-1，N是总观测值的数目，k是自变量数
# 本例中，N-7-1=185，即需要样本量 N = 185+7+1=193
