# sapply() 的核心逻辑是对输入对象的每个元素应用指定函数，而数据框的“元素”就是它的列

# 若干用户贡献的包都提供了计算描述性统计量的函数，其中包括Hmisc、pastecs、psych、skimr 和 summytools
# 可以使用以上任意一个包来生成统计汇总信息

# 代码清单7-3：通过Hmisc包中的describe()函数计算描述性统计量
# Hmisc 包中的 describe() 函数可返回变量和观测值的数量、缺失值 和 唯一值的数码、均值、分位数，以及5各最大的值和最小的值
version
install.packages("Hmisc")
install.packages("stringi")
library(Hmisc)
myvars <- c("mpg", "hp", "wt")
describe(mtcars[myvars])
#mtcars[myvars] 
#
#3  Variables      32  Observations
#-----------------------------------------------------------------------------------------------
#  mpg 
#n  missing distinct     Info     Mean  pMedian      Gmd      .05      .10      .25 
#32        0       25    0.999    20.09     19.6    6.796    12.00    14.34    15.43 
#.50      .75      .90      .95 
#19.20    22.80    30.09    31.30 
#
#lowest : 10.4 13.3 14.3 14.7 15  , highest: 26   27.3 30.4 32.4 33.9
#-----------------------------------------------------------------------------------------------
#  hp 
#n  missing distinct     Info     Mean  pMedian      Gmd      .05      .10      .25 
#32        0       22    0.997    146.7    142.5    77.04    63.65    66.00    96.50 
#.50      .75      .90      .95 
#123.00   180.00   243.50   253.55 
#
#lowest :  52  62  65  66  91, highest: 215 230 245 264 335
#-----------------------------------------------------------------------------------------------
#  wt 
#n  missing distinct     Info     Mean  pMedian      Gmd      .05      .10      .25 
#32        0       29    0.999    3.217    3.186    1.089    1.736    1.956    2.581 
#.50      .75      .90      .95 
#3.325    3.610    4.048    5.293 
#
#lowest : 1.513 1.615 1.835 1.935 2.14 , highest: 3.845 4.07  5.25  5.345 5.424
#-----------------------------------------------------------------------------------------------
