# 量变引起质变

# 代码清单10-0-2：用pwr包做功效分析
# Stephane Champely 开发的 pwr 包可以实现功效分析。
# 下表列出了一些非常重要的函数
# 对于每个函数，用户可以设定4个统计量（样本量、显著性水平、功效 和 效应值）中的3个，第4个统计量将由软件计算出来

#            pwr 包中的函数
# 函数               功效计算的对象
# pwr.2p.test        两个比例（n相等）
# pwr.2p2n,test      两个比例（n不相等）
# pwr.anova.test     平衡单因素方差分析
# pwr.chisq.test     卡方检验
# pwr.f2.test        广义线性模型
# pwr.p.test         比例（单样本）
# pwr.r.test         相关系数
# pwr.t.test         t检验（单样本、双样本、相依样本）
# pwr.t2n.test       t检验（n不相等的双样本）

# 4个统计量中，效应值是最难确定的。
# 计算效应值通常需要一些相关估计的经验和对过去研究知识的理解。
# 但是，如果子啊一个特定的研究中，我们对需要的效应值一无所知，该怎么做呢？
# 10.2.7节将会讨论这个难题。
# 本节接下来介绍 pwr 包里的函数在常见统计检验中的应用。
# 在调用以上函数时，请确定依据安装并载入 pwr 包
install.packages("pwr")
